grevaillot/svd_tools/headers/ATSAMR34J17B/memorymap.h
#pragma once 

#define PM_BASE			(0x40000000)
#define MCLK_BASE			(0x40000400)
#define RSTC_BASE			(0x40000800)
#define OSCCTRL_BASE			(0x40000c00)
#define OSC32KCTRL_BASE			(0x40001000)
#define SUPC_BASE			(0x40001400)
#define GCLK_BASE			(0x40001800)
#define WDT_BASE			(0x40001c00)
#define RTC_BASE			(0x40002000)
#define EIC_BASE			(0x40002400)
#define PORT_BASE			(0x40002800)
#define USB_BASE			(0x41000000)
#define DSU_BASE			(0x41002000)
#define NVMCTRL_BASE			(0x41004000)
#define MTB_BASE			(0x41006000)
#define SERCOM0_BASE			(0x42000000)
#define SERCOM1_BASE			(0x42000400)
#define SERCOM2_BASE			(0x42000800)
#define SERCOM3_BASE			(0x42000c00)
#define SERCOM4_BASE			(0x42001000)
#define TCC0_BASE			(0x42001400)
#define TCC1_BASE			(0x42001800)
#define TCC2_BASE			(0x42001c00)
#define TC0_BASE			(0x42002000)
#define TC1_BASE			(0x42002400)
#define TC2_BASE			(0x42002800)
#define TC3_BASE			(0x42002c00)
#define DAC_BASE			(0x42003000)
#define AES_BASE			(0x42003400)
#define TRNG_BASE			(0x42003800)
#define EVSYS_BASE			(0x43000000)
#define SERCOM5_BASE			(0x43000400)
#define TC4_BASE			(0x43000800)
#define ADC_BASE			(0x43000c00)
#define AC_BASE			(0x43001000)
#define CCL_BASE			(0x43001c00)
#define PAC_BASE			(0x44000000)
#define DMAC_BASE			(0x44000400)
#define PORT_IOBUS_BASE			(0x60000000)
